big-data-analytics/index.org
#+title: Big Data Analytics
#+SETUPFILE: /home/praaneshnair/.config/doom/templates/org/html-preamble.org

* Introduction

** What is Big Data?
- Big Data involves datasets that are too large or complex for traditional data
  processing application softwares.
- It counts as too large, if the data is in Gigabytes, Terabytes, Petabytes or
  maybe even Exabytes.
- The future involves an unofficial data size called Brontobyte ($10^{27}$ bytes).

** What is Big Data Analytics?
- Process of uncovering *trends*, *patterns* and *correlations* in large datasets.
- This is useful for risk management, and making better decisions.

** Three V's (Currently there are a lot more V's)
- These are core challenges involved with big data.
- These were coined by *Doug Laney* in 2001, in a report for [[https://www.gartner.com/en/documents/2057415][Gartner]].

*** Volume
- The data itself is in larger units. 

*** Velocity
- This is the rate at which data is being generated.
- This emphasizes on how close we are to real time processing of data.

*** Variety

**** Structured
- Data with a fixed format.
- For examples, spreadsheets and databases are structured data.
- DBMS operations are very fast, and this is very scalable.

**** Unstructured
- Data with no fixed format.
- For example, images, videos, text.
- 80% of the data is unstructured.

**** Semi-Structured
- It might have a fixed format, but might contain unstructured data.
- XML is a great example - it has a format (tags), but the content can be
  unstructured. A simpler example would be an email (from, to, CC, BCC form a
  structure, but the content can be anything).
- It's often either data with labels, or data in the form of key-value pairs.

*** Newer V's introduced in recent times

**** Value
- The ability to extract meaningful data.

**** Veracity
- Trustworthiness of data.
  
**** Validity
- Is the data correct or appropriate for its intended use?

**** Visualization
- Putting data in a human-interpretable form.

**** Variability
- Changes in the nature of the data.

**** Vulnerability
- Compromises in system security.

**** Viscosity
- How easy/difficult it is to combine/transfer data.

**** Volatility
- How long data is valid for, and how long it should be stored.
- This is the characteristics of data that deals with its *retention*.

**** Virality
- How far the existing data spreads around.

** Human-Generated Data vs Machine-Generated Data
- Examples of human-generated data are text messages, emails, documents.
- Examples of machine-generated data are outputs of sensors or system logs.

** Issues with Terminology related to Structure
- HTML is often debated between considered unstructured or semi-structured.
- This is because questions are being raised on whether the structure is
  actually helping analytics or not.


* Definition of Big Data
- It's a *high-volume*, *high-velocity* and *high-variety* information assets that
  demand *cost-effective*, *innovative* forms of information processing for *enhanced
  insight* and *decision making*.
  

* Types of Data Analytics

** Descriptive Analytics
- Describe the data i.e. tell you *what* happened in the past.
- This is done by summarizing the past data into a human-interpretable form (eg.
  charts, graphs, etc).


