big-data-analytics/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-28 Wed 10:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Big Data Analytics</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<meta property="og:image" content="https://notes.compileartisan.dev/assets/og-image.png">
<meta property="og:image:width" content="1200">
<meta property="og:image:height" content="630">
<meta property="og:type" content="website">
<meta property="og:title" content="%TITLE%">
<meta property="og:description" content="Notes from CompileArtisan">
<meta property="og:url" content="https://notes.compileartisan.dev">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:image" content="https://notes.compileartisan.dev/assets/og-image.png">
<div class="header">
<a href="https://compileartisan.pages.dev/">CompileArtisan</a>
</div>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Big Data Analytics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0ae9c4">1. Introduction</a>
<ul>
<li><a href="#org437af81">1.1. What is Big Data?</a></li>
<li><a href="#org0d6507a">1.2. What is Big Data Analytics?</a></li>
<li><a href="#org2e70242">1.3. Three V&rsquo;s (Currently there are a lot more V&rsquo;s)</a>
<ul>
<li><a href="#org4457b6a">1.3.1. Volume</a></li>
<li><a href="#orge6d203e">1.3.2. Velocity</a></li>
<li><a href="#orgd21da5f">1.3.3. Variety</a></li>
<li><a href="#org800a869">1.3.4. Newer V&rsquo;s introduced in recent times</a></li>
</ul>
</li>
<li><a href="#org5af1189">1.4. Human-Generated Data vs Machine-Generated Data</a></li>
<li><a href="#org1ff3434">1.5. Issues with Terminology related to Structure</a></li>
</ul>
</li>
<li><a href="#org8558523">2. Definition of Big Data</a></li>
<li><a href="#org3cc184d">3. Types of Data Analytics</a>
<ul>
<li><a href="#orgab93335">3.1. Descriptive Analytics</a></li>
<li><a href="#orgadfe192">3.2. Diagnostic Analytics</a></li>
<li><a href="#org28b9b13">3.3. Predictive Analytics</a></li>
<li><a href="#org4889395">3.4. Prescriptive Analytics</a></li>
</ul>
</li>
<li><a href="#org637db58">4. Database Architectures</a>
<ul>
<li><a href="#orge5f2b62">4.1. OLTP</a></li>
<li><a href="#orge662ae2">4.2. OLAP</a></li>
<li><a href="#orge056d67">4.3. RTAP</a></li>
</ul>
</li>
<li><a href="#org42156f9">5. Change in Trend</a></li>
<li><a href="#orga1b7ad3">6. Size Matters</a>
<ul>
<li><a href="#orgc16926c">6.1. In Bits</a></li>
<li><a href="#org85bbd6d">6.2. In General</a></li>
</ul>
</li>
<li><a href="#orgd1e047d">7. Traditional Business Intelligence vs Big Data</a></li>
<li><a href="#orgdad25dd">8. Transaction Processing</a>
<ul>
<li><a href="#orgc76adf3">8.1. Atomicity</a></li>
<li><a href="#org96f7305">8.2. Consistency</a></li>
<li><a href="#org9333aa0">8.3. Isolation</a></li>
<li><a href="#org4d09825">8.4. Durability</a></li>
</ul>
</li>
<li><a href="#org0addf18">9. Challenges</a>
<ul>
<li><a href="#orgcd70eae">9.1. Vertical and Horizontal Scaling</a></li>
<li><a href="#org913db17">9.2. Security</a></li>
<li><a href="#orgfd5e8d5">9.3. Schema</a></li>
<li><a href="#org32f6bbb">9.4. Continuous Availability</a></li>
<li><a href="#org36a1208">9.5. Consistency</a></li>
<li><a href="#orgd6f7718">9.6. Partition Tolerent</a></li>
<li><a href="#orga8f8c3b">9.7. Data Quality</a>
<ul>
<li><a href="#orgac1655e">9.7.1. 3Cs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbabf740">10. Brewer&rsquo;s CAP Theorem</a>
<ul>
<li><a href="#orga7ab68e">10.1. Consistency</a></li>
<li><a href="#org7887399">10.2. Availability</a></li>
<li><a href="#org39f549f">10.3. Partition Tolerance</a></li>
</ul>
</li>
<li><a href="#orgd9aa66c">11. BASE Theorem</a>
<ul>
<li><a href="#org00c5801">11.1. Basically Available</a></li>
<li><a href="#org572c7a1">11.2. Soft-state</a></li>
<li><a href="#orgcbc2e9f">11.3. Eventually Consistent</a></li>
</ul>
</li>
<li><a href="#orge639d3f">12. NoSQL</a>
<ul>
<li><a href="#org360c643">12.1. Sharding</a></li>
<li><a href="#org97fc319">12.2. Difference between SQL and NoSQL</a></li>
</ul>
</li>
<li><a href="#orgab7cdbe">13. NewSQL</a></li>
<li><a href="#org3815ab8">14. Hadoop</a>
<ul>
<li><a href="#org17af097">14.1. Hadoop Versions</a>
<ul>
<li><a href="#orgabcedef">14.1.1. Hadoop 1.x</a></li>
<li><a href="#orgf93c748">14.1.2. Hadoop 2.x</a></li>
</ul>
</li>
<li><a href="#orgeb74990">14.2. Basic Hadoop Architecture</a></li>
<li><a href="#org112f397">14.3. Challenges of Hadoop</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga0ae9c4" class="outline-2">
<h2 id="orga0ae9c4"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org437af81" class="outline-3">
<h3 id="org437af81"><span class="section-number-3">1.1.</span> What is Big Data?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Big Data involves datasets that are too large or complex for traditional data
processing application softwares.</li>
<li>It counts as too large, if the data is in Gigabytes, Terabytes, Petabytes or
maybe even Exabytes.</li>
<li>The future involves an unofficial data size called Brontobyte (\(10^{27}\) bytes).</li>
</ul>
</div>
</div>
<div id="outline-container-org0d6507a" class="outline-3">
<h3 id="org0d6507a"><span class="section-number-3">1.2.</span> What is Big Data Analytics?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Process of uncovering <b>trends</b>, <b>patterns</b> and <b>correlations</b> in large datasets.</li>
<li>This is useful for risk management, and making better decisions.</li>
</ul>
</div>
</div>
<div id="outline-container-org2e70242" class="outline-3">
<h3 id="org2e70242"><span class="section-number-3">1.3.</span> Three V&rsquo;s (Currently there are a lot more V&rsquo;s)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>These are core challenges involved with big data.</li>
<li>These were coined by <b>Doug Laney</b> in 2001, in a report for <a href="https://www.gartner.com/en/documents/2057415">Gartner</a>.</li>
</ul>
</div>
<div id="outline-container-org4457b6a" class="outline-4">
<h4 id="org4457b6a"><span class="section-number-4">1.3.1.</span> Volume</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>The data itself is in larger units.</li>
</ul>
</div>
</div>
<div id="outline-container-orge6d203e" class="outline-4">
<h4 id="orge6d203e"><span class="section-number-4">1.3.2.</span> Velocity</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>This is the rate at which data is being generated.</li>
<li>This emphasizes on how close we are to real time processing of data.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd21da5f" class="outline-4">
<h4 id="orgd21da5f"><span class="section-number-4">1.3.3.</span> Variety</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<ol class="org-ol">
<li><a id="org7aadcad"></a>Structured<br />
<div class="outline-text-5" id="text-1-3-3-1">
<ul class="org-ul">
<li>Data with a fixed format.</li>
<li>For examples, spreadsheets and databases are structured data.</li>
<li>DBMS operations are very fast, and this is very scalable.</li>
</ul>
</div>
</li>
<li><a id="org2566deb"></a>Unstructured<br />
<div class="outline-text-5" id="text-1-3-3-2">
<ul class="org-ul">
<li>Data with no fixed format.</li>
<li>For example, images, videos, text.</li>
<li>80% of the data is unstructured.</li>
</ul>
</div>
</li>
<li><a id="orgd13922b"></a>Semi-Structured<br />
<div class="outline-text-5" id="text-1-3-3-3">
<ul class="org-ul">
<li>It might have a fixed format, but might contain unstructured data.</li>
<li>XML is a great example - it has a format (tags), but the content can be
unstructured. A simpler example would be an email (from, to, CC, BCC form a
structure, but the content can be anything).</li>
<li>It&rsquo;s often either data with labels, or data in the form of key-value pairs.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org800a869" class="outline-4">
<h4 id="org800a869"><span class="section-number-4">1.3.4.</span> Newer V&rsquo;s introduced in recent times</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
<ol class="org-ol">
<li><a id="org44c08cb"></a>Value<br />
<div class="outline-text-5" id="text-1-3-4-1">
<ul class="org-ul">
<li>The ability to extract meaningful data.</li>
</ul>
</div>
</li>
<li><a id="orgb19d34c"></a>Veracity<br />
<div class="outline-text-5" id="text-1-3-4-2">
<ul class="org-ul">
<li>Trustworthiness of data.</li>
</ul>
</div>
</li>
<li><a id="orgf1dbd35"></a>Validity<br />
<div class="outline-text-5" id="text-1-3-4-3">
<ul class="org-ul">
<li>Is the data correct or appropriate for its intended use?</li>
</ul>
</div>
</li>
<li><a id="org1b31f6e"></a>Visualization<br />
<div class="outline-text-5" id="text-1-3-4-4">
<ul class="org-ul">
<li>Putting data in a human-interpretable form.</li>
</ul>
</div>
</li>
<li><a id="org693d015"></a>Variability<br />
<div class="outline-text-5" id="text-1-3-4-5">
<ul class="org-ul">
<li>Changes in the nature of the data.</li>
</ul>
</div>
</li>
<li><a id="org1a05deb"></a>Vulnerability<br />
<div class="outline-text-5" id="text-1-3-4-6">
<ul class="org-ul">
<li>Compromises in system security.</li>
</ul>
</div>
</li>
<li><a id="org66803f5"></a>Viscosity<br />
<div class="outline-text-5" id="text-1-3-4-7">
<ul class="org-ul">
<li>How easy/difficult it is to combine/transfer data.</li>
</ul>
</div>
</li>
<li><a id="org3bf93c0"></a>Volatility<br />
<div class="outline-text-5" id="text-1-3-4-8">
<ul class="org-ul">
<li>How long data is valid for, and how long it should be stored.</li>
<li>This is the characteristics of data that deals with its <b>retention</b>.</li>
</ul>
</div>
</li>
<li><a id="org924b538"></a>Virality<br />
<div class="outline-text-5" id="text-1-3-4-9">
<ul class="org-ul">
<li>How far the existing data spreads around.</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org5af1189" class="outline-3">
<h3 id="org5af1189"><span class="section-number-3">1.4.</span> Human-Generated Data vs Machine-Generated Data</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Examples of human-generated data are text messages, emails, documents.</li>
<li>Examples of machine-generated data are outputs of sensors or system logs.</li>
</ul>
</div>
</div>
<div id="outline-container-org1ff3434" class="outline-3">
<h3 id="org1ff3434"><span class="section-number-3">1.5.</span> Issues with Terminology related to Structure</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>HTML is often debated between considered unstructured or semi-structured.</li>
<li>This is because questions are being raised on whether the structure is
actually helping analytics or not.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8558523" class="outline-2">
<h2 id="org8558523"><span class="section-number-2">2.</span> Definition of Big Data</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>It&rsquo;s a <b>high-volume</b>, <b>high-velocity</b> and <b>high-variety</b> information assets that
demand <b>cost-effective</b>, <b>innovative</b> forms of information processing for <b>enhanced
insight</b> and <b>decision making</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-org3cc184d" class="outline-2">
<h2 id="org3cc184d"><span class="section-number-2">3.</span> Types of Data Analytics</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgab93335" class="outline-3">
<h3 id="orgab93335"><span class="section-number-3">3.1.</span> Descriptive Analytics</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Describe the data i.e. tell you <b>what</b> happened in the past.</li>
<li>This is done by summarizing the past data into a human-interpretable form (eg.
charts, graphs, etc).</li>
</ul>
</div>
</div>
