big-data-analytics/index.org
** Diagnostic Analytics
- Understand *why* something happened in the past.
- This is done using techniques like *drill-down*, *data-mining* and *data-discovery*.

** Predictive Analytics
- Predicts what's most likely to happen in the *future*.

** Prescriptive Analytics
- What *actions* to take to affect those outcomes.

* Database Architectures
Refer to [[https://www.tinybird.co/blog/oltp-vs-olap][OLTP vs OLAP: key differences, use cases, and architectures]].

** OLTP
- Stands for Online Transaction Processing.
- This is essentially DBMS.

** OLAP
- Online Analytical Processing.
- This is also alled data warehousing and these are ways to analyse the results
  of OLTP.

** RTAP
- Real-time Analytics Processing.
- It's also known as HTAP - Hybrid Transactional/ Analytical Processing

* Change in Trend
- Models have changed: previously the amount of people generating big-data was
  less, and the consumers were high in number.
- Now, everyone is both generating and consuming big data.

* Size Matters

** In Bits
| Unit     | Number of Bits |
|----------+----------------|
| Bit      |              1 |
| Byte     |              8 |
| Kibibyte |           1024 |
| Kilobyte |           1000 |
| Mebibyte |         1024^2 |
| Megabyte |         1000^2 |
| Gibibyte |         1024^3 |
| Gigabyte |         1000^3 |
| Tebibyte |         1024^4 |
| Terabyte |         1000^4 |

** In General 

| Unit        | Equivalent Number |
|-------------+-------------------|
| Thousand    | 10^3              |
| Million     | 10^6              |
| Billion     | 10^9              |
| Trillion    | 10^{12}              |
| Quadrillion | 10^{15}              |
| Quintillion | 10^{18}              |

As a function of time:
- 1 Million Seconds is 12 days
- 1 Billion Seconds is 31.7 years
- 1 Trillion Seconds is 31.7 Thousand (31,700) years
- 1 Quadrillion Seconds is 31.7 Million Years
- 1 Quintillion Seconds is 31.7 Billion Years

* Traditional Business Intelligence vs Big Data

| Traditional Business Intelligence | Big Data          |
|-----------------------------------+-------------------|
| Move Data to Code                 | Move Code to Data |

* Transaction Processing 
- Ensures that DBMS operations happen as one single indivisible unit with the
  help of ACID properties
** Atomicity
- Transaction either completely finishes, or doesn't happen at all. There's no
  partially completed state.
** Consistency 
- Changes must reflect everywhere.
- All integrity constraints must satisfy.
** Isolation 
- Two transactions shouldn't interfere with each other
** Durability
- Transactions must be permanent.


* Challenges

** Vertical and Horizontal Scaling
- Vertical Scaling (scaling-up) is adding more CPUs, RAM to a single server.
- Horizontal Scaling (scaling-out) is adding more servers altogether to
  distribute the work load.

** Security

** Schema
- Has to be dynamic.

** Continuous Availability

** Consistency

** Partition Tolerent
- This is regarding the partitions in a network.
- Partition Tolerant tells us how we have to take care of hardware and software
  failures involved in a Network.

** Data Quality
*** 3Cs
- Completeness, Consistency, Cleanliness
  
* Brewer's CAP Theorem
- A system that has consistency and partition tolerance, but compromises
  availability is called a *CP* system. (note that it's compromised, not
  non-existent).
- A system that has availability and partition tolerance, but compromises
  availability is called an *AP* system.
- You can make a *CP* system or an *AP* system. 
- The theorem says that partition tolerence is unavoidable, because we are
  dealing with networks.
- Departing from CAP theorem, if *P* was compromised, it would be a *CA* system.
  There's no network involved and hence we're talking about your local system.
- Refer to [[https://www.infoq.com/articles/cap-twelve-years-later-how-the-rules-have-changed/][CAP Twelve Years Later: How the "Rules" Have Changed - InfoQ]].

** Consistency
- All reads receive the most recent write or an error.


** Availability
- All reads contain data, but it might not be the most recent.

