big-data-analytics/index.html
<div id="outline-container-orgadfe192" class="outline-3">
<h3 id="orgadfe192"><span class="section-number-3">3.2.</span> Diagnostic Analytics</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Understand <b>why</b> something happened in the past.</li>
<li>This is done using techniques like <b>drill-down</b>, <b>data-mining</b> and <b>data-discovery</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-org28b9b13" class="outline-3">
<h3 id="org28b9b13"><span class="section-number-3">3.3.</span> Predictive Analytics</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Predicts what&rsquo;s most likely to happen in the <b>future</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-org4889395" class="outline-3">
<h3 id="org4889395"><span class="section-number-3">3.4.</span> Prescriptive Analytics</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>What <b>actions</b> to take to affect those outcomes.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org637db58" class="outline-2">
<h2 id="org637db58"><span class="section-number-2">4.</span> Database Architectures</h2>
<div class="outline-text-2" id="text-4">
<p>
Refer to <a href="https://www.tinybird.co/blog/oltp-vs-olap">OLTP vs OLAP: key differences, use cases, and architectures</a>.
</p>
</div>
<div id="outline-container-orge5f2b62" class="outline-3">
<h3 id="orge5f2b62"><span class="section-number-3">4.1.</span> OLTP</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Stands for Online Transaction Processing.</li>
<li>This is essentially DBMS.</li>
</ul>
</div>
</div>
<div id="outline-container-orge662ae2" class="outline-3">
<h3 id="orge662ae2"><span class="section-number-3">4.2.</span> OLAP</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Online Analytical Processing.</li>
<li>This is also alled data warehousing and these are ways to analyse the results
of OLTP.</li>
</ul>
</div>
</div>
<div id="outline-container-orge056d67" class="outline-3">
<h3 id="orge056d67"><span class="section-number-3">4.3.</span> RTAP</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Real-time Analytics Processing.</li>
<li>It&rsquo;s also known as HTAP - Hybrid Transactional/ Analytical Processing</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org42156f9" class="outline-2">
<h2 id="org42156f9"><span class="section-number-2">5.</span> Change in Trend</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Models have changed: previously the amount of people generating big-data was
less, and the consumers were high in number.</li>
<li>Now, everyone is both generating and consuming big data.</li>
</ul>
</div>
</div>
<div id="outline-container-orga1b7ad3" class="outline-2">
<h2 id="orga1b7ad3"><span class="section-number-2">6.</span> Size Matters</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc16926c" class="outline-3">
<h3 id="orgc16926c"><span class="section-number-3">6.1.</span> In Bits</h3>
<div class="outline-text-3" id="text-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Unit</th>
<th scope="col" class="org-left">Number of Bits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Bit</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">Byte</td>
<td class="org-left">8</td>
</tr>

<tr>
<td class="org-left">Kibibyte</td>
<td class="org-left">1024</td>
</tr>

<tr>
<td class="org-left">Kilobyte</td>
<td class="org-left">1000</td>
</tr>

<tr>
<td class="org-left">Mebibyte</td>
<td class="org-left">1024<sup>2</sup></td>
</tr>

<tr>
<td class="org-left">Megabyte</td>
<td class="org-left">1000<sup>2</sup></td>
</tr>

<tr>
<td class="org-left">Gibibyte</td>
<td class="org-left">1024<sup>3</sup></td>
</tr>

<tr>
<td class="org-left">Gigabyte</td>
<td class="org-left">1000<sup>3</sup></td>
</tr>

<tr>
<td class="org-left">Tebibyte</td>
<td class="org-left">1024<sup>4</sup></td>
</tr>

<tr>
<td class="org-left">Terabyte</td>
<td class="org-left">1000<sup>4</sup></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org85bbd6d" class="outline-3">
<h3 id="org85bbd6d"><span class="section-number-3">6.2.</span> In General</h3>
<div class="outline-text-3" id="text-6-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Unit</th>
<th scope="col" class="org-left">Equivalent Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Thousand</td>
<td class="org-left">10<sup>3</sup></td>
</tr>

<tr>
<td class="org-left">Million</td>
<td class="org-left">10<sup>6</sup></td>
</tr>

<tr>
<td class="org-left">Billion</td>
<td class="org-left">10<sup>9</sup></td>
</tr>

<tr>
<td class="org-left">Trillion</td>
<td class="org-left">10<sup>12</sup></td>
</tr>

<tr>
<td class="org-left">Quadrillion</td>
<td class="org-left">10<sup>15</sup></td>
</tr>

<tr>
<td class="org-left">Quintillion</td>
<td class="org-left">10<sup>18</sup></td>
</tr>
</tbody>
</table>

<p>
As a function of time:
</p>
<ul class="org-ul">
<li>1 Million Seconds is 12 days</li>
<li>1 Billion Seconds is 31.7 years</li>
<li>1 Trillion Seconds is 31.7 Thousand (31,700) years</li>
<li>1 Quadrillion Seconds is 31.7 Million Years</li>
<li>1 Quintillion Seconds is 31.7 Billion Years</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd1e047d" class="outline-2">
<h2 id="orgd1e047d"><span class="section-number-2">7.</span> Traditional Business Intelligence vs Big Data</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Traditional Business Intelligence</th>
<th scope="col" class="org-left">Big Data</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Move Data to Code</td>
<td class="org-left">Move Code to Data</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdad25dd" class="outline-2">
<h2 id="orgdad25dd"><span class="section-number-2">8.</span> Transaction Processing</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Ensures that DBMS operations happen as one single indivisible unit with the
help of ACID properties</li>
</ul>
</div>
<div id="outline-container-orgc76adf3" class="outline-3">
<h3 id="orgc76adf3"><span class="section-number-3">8.1.</span> Atomicity</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Transaction either completely finishes, or doesn&rsquo;t happen at all. There&rsquo;s no
partially completed state.</li>
</ul>
</div>
</div>
<div id="outline-container-org96f7305" class="outline-3">
<h3 id="org96f7305"><span class="section-number-3">8.2.</span> Consistency</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Changes must reflect everywhere.</li>
<li>All integrity constraints must satisfy.</li>
</ul>
</div>
</div>
<div id="outline-container-org9333aa0" class="outline-3">
<h3 id="org9333aa0"><span class="section-number-3">8.3.</span> Isolation</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Two transactions shouldn&rsquo;t interfere with each other</li>
</ul>
</div>
</div>
<div id="outline-container-org4d09825" class="outline-3">
<h3 id="org4d09825"><span class="section-number-3">8.4.</span> Durability</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>Transactions must be permanent.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0addf18" class="outline-2">
<h2 id="org0addf18"><span class="section-number-2">9.</span> Challenges</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgcd70eae" class="outline-3">
<h3 id="orgcd70eae"><span class="section-number-3">9.1.</span> Vertical and Horizontal Scaling</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Vertical Scaling (scaling-up) is adding more CPUs, RAM to a single server.</li>
<li>Horizontal Scaling (scaling-out) is adding more servers altogether to
distribute the work load.</li>
</ul>
</div>
</div>
<div id="outline-container-org913db17" class="outline-3">
<h3 id="org913db17"><span class="section-number-3">9.2.</span> Security</h3>
</div>

<div id="outline-container-orgfd5e8d5" class="outline-3">
<h3 id="orgfd5e8d5"><span class="section-number-3">9.3.</span> Schema</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Has to be dynamic.</li>
</ul>
</div>
</div>
<div id="outline-container-org32f6bbb" class="outline-3">
<h3 id="org32f6bbb"><span class="section-number-3">9.4.</span> Continuous Availability</h3>
</div>

<div id="outline-container-org36a1208" class="outline-3">
<h3 id="org36a1208"><span class="section-number-3">9.5.</span> Consistency</h3>
</div>

<div id="outline-container-orgd6f7718" class="outline-3">
<h3 id="orgd6f7718"><span class="section-number-3">9.6.</span> Partition Tolerent</h3>
<div class="outline-text-3" id="text-9-6">
<ul class="org-ul">
<li>This is regarding the partitions in a network.</li>
<li>Partition Tolerant tells us how we have to take care of hardware and software
failures involved in a Network.</li>
</ul>
</div>
</div>
<div id="outline-container-orga8f8c3b" class="outline-3">
<h3 id="orga8f8c3b"><span class="section-number-3">9.7.</span> Data Quality</h3>
<div class="outline-text-3" id="text-9-7">
</div>
<div id="outline-container-orgac1655e" class="outline-4">
<h4 id="orgac1655e"><span class="section-number-4">9.7.1.</span> 3Cs</h4>
<div class="outline-text-4" id="text-9-7-1">
<ul class="org-ul">
<li>Completeness, Consistency, Cleanliness</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbabf740" class="outline-2">
<h2 id="orgbabf740"><span class="section-number-2">10.</span> Brewer&rsquo;s CAP Theorem</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>A system that has consistency and partition tolerance, but compromises
availability is called a <b>CP</b> system. (note that it&rsquo;s compromised, not
non-existent).</li>
<li>A system that has availability and partition tolerance, but compromises
availability is called an <b>AP</b> system.</li>
<li>You can make a <b>CP</b> system or an <b>AP</b> system.</li>
<li>The theorem says that partition tolerence is unavoidable, because we are
dealing with networks.</li>
<li>Departing from CAP theorem, if <b>P</b> was compromised, it would be a <b>CA</b> system.
There&rsquo;s no network involved and hence we&rsquo;re talking about your local system.</li>
<li>Refer to <a href="https://www.infoq.com/articles/cap-twelve-years-later-how-the-rules-have-changed/">CAP Twelve Years Later: How the &ldquo;Rules&rdquo; Have Changed - InfoQ</a>.</li>
</ul>
</div>
<div id="outline-container-orga7ab68e" class="outline-3">
<h3 id="orga7ab68e"><span class="section-number-3">10.1.</span> Consistency</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>All reads receive the most recent write or an error.</li>
</ul>
</div>
</div>
<div id="outline-container-org7887399" class="outline-3">
<h3 id="org7887399"><span class="section-number-3">10.2.</span> Availability</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>All reads contain data, but it might not be the most recent.</li>
</ul>
</div>
</div>
