big-data-analytics/index.org
** Partition Tolerance
- The system continues to be operate despite network failure.

* BASE Theorem
- BASE stands for Basically Available Soft-state Eventual-consistency
  
** Basically Available
- If a particular node fails in a network, data on that will not be available.
  But the entire data layer is still operational.
  
** Soft-state
- The design principle in which the state of the system may change over a period
  of time, even without any input, is called soft-state.
- Maintaining strong consistency might be costly and could be impractical at
  times. This is when soft-state is preferred.

** Eventually Consistent
- It's a guarantee that if the system will have consistent values applied at a
  certain point of time.

* NoSQL
- It stands for *Not Only SQL*.

** Sharding
- Splitting a large dataset into smaller, more manageable pieces called "shards"
  is called sharding.
- These shards are distributed across multiple systems to improve scalability
  and performance. (because this paves way for parallel processing).

** Difference between SQL and NoSQL

| SQL                               | NoSQL                              |
|-----------------------------------+------------------------------------|
| Follows ACID Properties           | Follows Brewer's CAP theorem       |
| Standardized                      | Not Standardized                   |
| No support for horizontal scaling | Has Support for horizontal scaling |

* NewSQL
- NewSQL is a mixture of both SQL and NoSQL

# file:/home/praaneshnair/gitProjects/org-notes/big-data-analytics/mongodb.org

* Hadoop
- It's an open-source framework use to process enormous data sets.
- Hadoop allows *distributed processing*, across a cluster of *commodity hardware*
  (inexpensive, widely available hardware).
- Hadoop was inspired by *Google File System* for distributed storage.
- In 2007, Yahoo started using Hadoop on a 1000 node cluster. It was in 2008
  Hadoop defeated supercomputers.

** Hadoop Versions

*** Hadoop 1.x
These are the components of a node using Hadoop 1.x.
**** HDFS
- This is for reliable storage.
- HDFS stands for *Hadoop Distributed File System*.
  
***** Blocks
- This is the minimum amount of data that can be read or written. (64 MB or 128 MB).
- By default there are 3 replicas of data (3 blocks, each placed in a different
  rack).
  - The first replica is placed on the local node
  - The second replica is placed on a remote rack.
  - The third replica is placed on the same remote rack as the second one
- The client reads from the nearest replica.

***** Rack
- It's a collection of 40-50 data nodes using the same network switch.

| Rack1  | Rack2  | Rack3 |
|--------+--------+-------|
| Block1 | ~_~      | ~_~     |
| ~_~      | Block1 | ~_~     |
| ~_~      | ~_~      | ~_~     |
| ~_~      | Block1 | ~_~     |


***** Rack Awareness
- Choosing data node racks that are closest to each other is called rack
  awareness.
  
***** Master/Slave Architecture - Node
****** NameNode
- Master of the system
- Maintains and manages the blocks present on the Data Node.
- These are up and running all the time.

****** DataNode
- Slaves whcih are deployed on each machine and provide the actual storage.
- Responsible for serving read/write requests to the client.

**** MapReduce
- This is for cluster resource management and data processing.
- It's also known as Hadoop's processing unit.

*** Hadoop 2.x
These are the components of a node using Hadoop 2.x.
**** HDFS
- Reliable Storage.

**** Yarn
- Cluster Resource Managment
- Yarn stands for *Yet Another Resource Negotiator*.

**** MapReduce
- Data processing

** Basic Hadoop Architecture
- There is one *master node* and multiple *slave nodes*.

** Challenges of Hadoop
- Hadoop is meant for processing large and immutable datasets, not transactions
  which are ACID-compliant.
