big-data-analytics/index.html
<div id="outline-container-org39f549f" class="outline-3">
<h3 id="org39f549f"><span class="section-number-3">10.3.</span> Partition Tolerance</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>The system continues to be operate despite network failure.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd9aa66c" class="outline-2">
<h2 id="orgd9aa66c"><span class="section-number-2">11.</span> BASE Theorem</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>BASE stands for Basically Available Soft-state Eventual-consistency</li>
</ul>
</div>
<div id="outline-container-org00c5801" class="outline-3">
<h3 id="org00c5801"><span class="section-number-3">11.1.</span> Basically Available</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>If a particular node fails in a network, data on that will not be available.
But the entire data layer is still operational.</li>
</ul>
</div>
</div>
<div id="outline-container-org572c7a1" class="outline-3">
<h3 id="org572c7a1"><span class="section-number-3">11.2.</span> Soft-state</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>The design principle in which the state of the system may change over a period
of time, even without any input, is called soft-state.</li>
<li>Maintaining strong consistency might be costly and could be impractical at
times. This is when soft-state is preferred.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcbc2e9f" class="outline-3">
<h3 id="orgcbc2e9f"><span class="section-number-3">11.3.</span> Eventually Consistent</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>It&rsquo;s a guarantee that if the system will have consistent values applied at a
certain point of time.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge639d3f" class="outline-2">
<h2 id="orge639d3f"><span class="section-number-2">12.</span> NoSQL</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>It stands for <b>Not Only SQL</b>.</li>
</ul>
</div>
<div id="outline-container-org360c643" class="outline-3">
<h3 id="org360c643"><span class="section-number-3">12.1.</span> Sharding</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>Splitting a large dataset into smaller, more manageable pieces called &ldquo;shards&rdquo;
is called sharding.</li>
<li>These shards are distributed across multiple systems to improve scalability
and performance. (because this paves way for parallel processing).</li>
</ul>
</div>
</div>
<div id="outline-container-org97fc319" class="outline-3">
<h3 id="org97fc319"><span class="section-number-3">12.2.</span> Difference between SQL and NoSQL</h3>
<div class="outline-text-3" id="text-12-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">SQL</th>
<th scope="col" class="org-left">NoSQL</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Follows ACID Properties</td>
<td class="org-left">Follows Brewer&rsquo;s CAP theorem</td>
</tr>

<tr>
<td class="org-left">Standardized</td>
<td class="org-left">Not Standardized</td>
</tr>

<tr>
<td class="org-left">No support for horizontal scaling</td>
<td class="org-left">Has Support for horizontal scaling</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgab7cdbe" class="outline-2">
<h2 id="orgab7cdbe"><span class="section-number-2">13.</span> NewSQL</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>NewSQL is a mixture of both SQL and NoSQL</li>
</ul>
</div>
</div>
<div id="outline-container-org3815ab8" class="outline-2">
<h2 id="org3815ab8"><span class="section-number-2">14.</span> Hadoop</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>It&rsquo;s an open-source framework use to process enormous data sets.</li>
<li>Hadoop allows <b>distributed processing</b>, across a cluster of <b>commodity hardware</b>
(inexpensive, widely available hardware).</li>
<li>Hadoop was inspired by <b>Google File System</b> for distributed storage.</li>
<li>In 2007, Yahoo started using Hadoop on a 1000 node cluster. It was in 2008
Hadoop defeated supercomputers.</li>
</ul>
</div>
<div id="outline-container-org17af097" class="outline-3">
<h3 id="org17af097"><span class="section-number-3">14.1.</span> Hadoop Versions</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-orgabcedef" class="outline-4">
<h4 id="orgabcedef"><span class="section-number-4">14.1.1.</span> Hadoop 1.x</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
These are the components of a node using Hadoop 1.x.
</p>
</div>
<ol class="org-ol">
<li><a id="orgb53f73a"></a>HDFS<br />
<div class="outline-text-5" id="text-14-1-1-1">
<ul class="org-ul">
<li>This is for reliable storage.</li>
<li>HDFS stands for <b>Hadoop Distributed File System</b>.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orge22f760"></a>Blocks<br />
<div class="outline-text-6" id="text-14-1-1-1-1">
<ul class="org-ul">
<li>This is the minimum amount of data that can be read or written. (64 MB or 128 MB).</li>
<li>By default there are 3 replicas of data (3 blocks, each placed in a different
rack).
<ul class="org-ul">
<li>The first replica is placed on the local node</li>
<li>The second replica is placed on a remote rack.</li>
<li>The third replica is placed on the same remote rack as the second one</li>
</ul></li>
<li>The client reads from the nearest replica.</li>
</ul>
</div>
</li>
<li><a id="org86beb65"></a>Rack<br />
<div class="outline-text-6" id="text-14-1-1-1-2">
<ul class="org-ul">
<li>It&rsquo;s a collection of 40-50 data nodes using the same network switch.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rack1</th>
<th scope="col" class="org-left">Rack2</th>
<th scope="col" class="org-left">Rack3</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Block1</td>
<td class="org-left"><code>_</code></td>
<td class="org-left"><code>_</code></td>
</tr>

<tr>
<td class="org-left"><code>_</code></td>
<td class="org-left">Block1</td>
<td class="org-left"><code>_</code></td>
</tr>

<tr>
<td class="org-left"><code>_</code></td>
<td class="org-left"><code>_</code></td>
<td class="org-left"><code>_</code></td>
</tr>

<tr>
<td class="org-left"><code>_</code></td>
<td class="org-left">Block1</td>
<td class="org-left"><code>_</code></td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgca4a513"></a>Rack Awareness<br />
<div class="outline-text-6" id="text-14-1-1-1-3">
<ul class="org-ul">
<li>Choosing data node racks that are closest to each other is called rack
awareness.</li>
</ul>
</div>
</li>
<li><a id="org4e9ff4b"></a>Master/Slave Architecture - Node<br />
<ol class="org-ol">
<li><a id="orgd2ca9cf"></a>NameNode<br />
<div class="outline-text-7" id="text-14-1-1-1-4-1">
<ul class="org-ul">
<li>Master of the system</li>
<li>Maintains and manages the blocks present on the Data Node.</li>
<li>These are up and running all the time.</li>
</ul>
</div>
</li>
<li><a id="org225cba8"></a>DataNode<br />
<div class="outline-text-7" id="text-14-1-1-1-4-2">
<ul class="org-ul">
<li>Slaves whcih are deployed on each machine and provide the actual storage.</li>
<li>Responsible for serving read/write requests to the client.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orgc23ca20"></a>MapReduce<br />
<div class="outline-text-5" id="text-14-1-1-2">
<ul class="org-ul">
<li>This is for cluster resource management and data processing.</li>
<li>It&rsquo;s also known as Hadoop&rsquo;s processing unit.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf93c748" class="outline-4">
<h4 id="orgf93c748"><span class="section-number-4">14.1.2.</span> Hadoop 2.x</h4>
<div class="outline-text-4" id="text-14-1-2">
<p>
These are the components of a node using Hadoop 2.x.
</p>
</div>
<ol class="org-ol">
<li><a id="org433629c"></a>HDFS<br />
<div class="outline-text-5" id="text-14-1-2-1">
<ul class="org-ul">
<li>Reliable Storage.</li>
</ul>
</div>
</li>
<li><a id="orgf16c783"></a>Yarn<br />
<div class="outline-text-5" id="text-14-1-2-2">
<ul class="org-ul">
<li>Cluster Resource Managment</li>
<li>Yarn stands for <b>Yet Another Resource Negotiator</b>.</li>
</ul>
</div>
</li>
<li><a id="orgf9ccf66"></a>MapReduce<br />
<div class="outline-text-5" id="text-14-1-2-3">
<ul class="org-ul">
<li>Data processing</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgeb74990" class="outline-3">
<h3 id="orgeb74990"><span class="section-number-3">14.2.</span> Basic Hadoop Architecture</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>There is one <b>master node</b> and multiple <b>slave nodes</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-org112f397" class="outline-3">
<h3 id="org112f397"><span class="section-number-3">14.3.</span> Challenges of Hadoop</h3>
<div class="outline-text-3" id="text-14-3">
<ul class="org-ul">
<li>Hadoop is meant for processing large and immutable datasets, not transactions
which are ACID-compliant.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
